// pages/index/infomation/infomation.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    titleText: "建设规划各条线基本情况如下",
    content: ["1号线一期东延工程：由一期武宿机场T2航站楼向东南敷设至武宿机场T3航站楼，线路长度2.1km，共设置1座车站。",
    "2号线二期工程：为一期工程延伸线，共分南北两段，南段由一期线路起点向南延伸1站1区间，长度约0.85km，北段由一期线路终点向北延伸2站2区间，长度约2.44km，二期工程合计长度为3.29km，共设置3座车站。",
    "3号线一期工程：为市区骨干线路，将初步完善轨道交通骨干网络，重点连接了河西各片区和铁路太原南站枢纽，线路北起柴村，东至东峰，全长31.07km，共设置25座车站、1座车辆段和1座停车场。", 
    "R3号线：为山西转型综合改革示范区南北向骨干轨道交通线路，线路主要服务于小店区、潇河产业园区，线路北起小店南，南至潇河高铁站，全长19km，共设置7座车站、1座车辆段。"]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})